In [31]:
import pandas as pd

In [32]:
# create sample data
my_df = pd.DataFrame({
    'customer_id': [1, 1, 2, 2, 3],
    'transaction_id': [101, 102, 103, 103, 104]
})
my_df

   customer_id  transaction_id
0            1             101
1            1             102
2            2             103
3            2             103
4            3             104

In [33]:
# identify duplicate rows (True)
my_df['transaction_id'].duplicated()

0    False
1    False
2    False
3     True
4    False
Name: transaction_id, dtype: bool

In [34]:
# view rows with duplicate data
my_df[my_df['transaction_id'].duplicated()]

   customer_id  transaction_id
3            2             103

In [35]:
# use keep paramenter to decide which record is the duplicate (default first)
my_df['transaction_id'].duplicated(keep = 'last')

0    False
1    False
2     True
3    False
4    False
Name: transaction_id, dtype: bool

In [36]:
# use keep parameter with False if you want to identify all rows with a duplicate value
my_df['transaction_id'].duplicated(keep = False)

0    False
1    False
2     True
3     True
4    False
Name: transaction_id, dtype: bool

In [37]:
# drop row with duplicate value
my_df.drop_duplicates(keep = 'first', inplace = True)
my_df

   customer_id  transaction_id
0            1             101
1            1             102
2            2             103
4            3             104